Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/atdf/ATSAME70N19B.atdf
        <register caption="Interrupt Disable Register Priority Queue (index = 1) 0" name="GMAC_IDRPQ" offset="0x61C" rw="W" size="4" count="5" atomic-op="clear:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Mask Register Priority Queue (index = 1) 0" name="GMAC_IMRPQ" offset="0x63C" rw="RW" size="4" count="5" atomic-op="read:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="AHB Error" mask="0x00000040" name="AHB"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Screening Type 2 Ethertype Register (index = 0) 0" name="GMAC_ST2ER" offset="0x6E0" rw="RW" size="4" count="4">
          <bitfield caption="Ethertype Compare Value" mask="0x0000FFFF" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 0)" name="GMAC_ST2CW00" offset="0x700" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 0)" name="GMAC_ST2CW10" offset="0x704" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW10__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 1)" name="GMAC_ST2CW01" offset="0x708" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 1)" name="GMAC_ST2CW11" offset="0x70C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW11__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 2)" name="GMAC_ST2CW02" offset="0x710" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 2)" name="GMAC_ST2CW12" offset="0x714" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW12__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 3)" name="GMAC_ST2CW03" offset="0x718" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 3)" name="GMAC_ST2CW13" offset="0x71C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW13__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 4)" name="GMAC_ST2CW04" offset="0x720" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 4)" name="GMAC_ST2CW14" offset="0x724" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW14__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 5)" name="GMAC_ST2CW05" offset="0x728" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 5)" name="GMAC_ST2CW15" offset="0x72C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW15__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 6)" name="GMAC_ST2CW06" offset="0x730" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
